package HW_CrazyTesters.Less_3_to_5;

public class Task8_diamondShape {
    public static void main(String[] args) {
// Напишите программу на Java, которая запрашивает у пользователя ввод
// нечетного числа и выводит на экран ромб, состоящий из звездочек *.
// Ширина ромба равна введенному числу, и он должен быть симметричным
// относительно своей горизонтальной и вертикальной оси.
// Пример вывода для числа 5:
//   *
//  ***
// *****
//  ***
//   *
// Примечание: Ширина ромба (в данном случае 5) определяет как количество звездочек
// в его самой широкой части, так и общее количество строк.


    }
}
