package HW.HW6;
/*
    Задача №3

    Необходимо создать утилитарный класс (класс только со статическими полями и методами) со следующими методами:
    поиск сотрудника в массиве по его имени
    поиск сотрудника в массиве по вхождению указанной строки в его имени
    подсчет зарплатного бюджета для всех сотрудников в массиве
    поиск наименьшей зарплаты в массиве
    поиск наибольшей зарплаты в массиве
    поиск наименьшего количества подчиненных в массиве менеджеров
    поиск наибольшего количества подчиненных в массиве менеджеров
    поиск наибольшей надбавки (разнице между базовой ставкой и зарплатой) в массиве менеджеров
    поиск наименьшей надбавки (разнице между базовой ставкой и зарплатой) в массиве менеджеров
*/
public class EmployeeUtils {
//    поиск сотрудника в массиве по его имени
    public static Employee findByName(Employee[] employees, String byName){
        for(Employee employee : employees){
            if (employee.getName().equals(byName)){
                return employee;
            }
        }
        return null;
    }
}
